In [1]:
# Importamos las librerías que necesitamos
import numpy as np
# Librerías de extracción de datos
# -----------------------------------------------------------------------
from bs4 import BeautifulSoup
import requests
import re
# Tratamiento de datos
# -----------------------------------------------------------------------
import pandas as pd
from tqdm import tqdm
import random
import time

In [7]:
# prueba para uno
url_salarios_lebron = f'https://hoopshype.com/player/lebron-james/salary/'
# Paso 2
response = requests.get(url_salarios_lebron)
# Paso 3
if str(response) == '<Response [200]>':
    print(response.status_code)
    # Paso 4
    sopa = (BeautifulSoup(response.content, 'html.parser'))
    time.sleep(random.uniform(1,3))
else: 
    print('Hay un error')

200

In [20]:
lista = sopa.findAll('div', {'class' : 'player-payroll'})
#aqui saco la sopa de datos con las dos tablas

In [27]:
# al tener dos tablas(una a futuro y otra del pasado, busco la del pasado)
for i in lista:
    if i.find('span').text == 'Past Salaries':
        tabla_salarios_pasado = i.find('table')

In [58]:
filas = tabla_salarios_pasado.find("tbody").findAll('tr') # me quedo con las filas de informacion

In [59]:
len(filas)

21

In [60]:
lista_vacia = []
for fila in filas:
    valores = fila.find_all('td')
    temporada = valores[0].text.strip()
    equipo = valores[1].text.strip()
    salario = valores[2].text.strip()

    diccionario = {'Temporada': temporada,
               'Equipo': equipo,
               'Salario': salario}
    lista_vacia.append(diccionario)

In [61]:
df = pd.DataFrame(lista_vacia)

In [62]:
df

   Temporada               Equipo                     Salario
0    2023/24   Los Angeles Lakers  $47,607,350 ($47,607,350*)
1    2022/23   Los Angeles Lakers  $44,474,988 ($45,795,529*)
2    2021/22   Los Angeles Lakers  $41,180,544 ($46,244,900*)
3    2020/21   Los Angeles Lakers  $39,219,566 ($46,417,307*)
4    2019/20   Los Angeles Lakers  $37,436,858 ($44,593,536*)
5    2018/19   Los Angeles Lakers  $35,654,150 ($43,170,146*)
6    2017/18  Cleveland Cavaliers  $33,285,709 ($41,459,735*)
7    2016/17  Cleveland Cavaliers  $30,963,450 ($39,197,185*)
8    2015/16  Cleveland Cavaliers  $22,970,500 ($29,368,777*)
9    2014/15  Cleveland Cavaliers  $20,644,400 ($26,427,427*)
10   2013/14           Miami Heat  $19,067,500 ($24,914,630*)
11   2012/13           Miami Heat  $17,545,000 ($23,327,453*)
12   2011/12           Miami Heat  $16,022,500 ($21,657,653*)
13   2010/11           Miami Heat  $14,500,000 ($20,297,205*)
14   2009/10  Cleveland Cavaliers  $15,779,912 ($22,321,508*)
15   2008/09  Cleveland Cavaliers  $14,410,581 ($20,093,677*)
16   2007/08  Cleveland Cavaliers  $13,041,250 ($19,097,502*)
17   2006/07  Cleveland Cavaliers    $5,828,090 ($8,763,936*)
18   2005/06  Cleveland Cavaliers    $4,621,800 ($7,250,142*)
19   2004/05  Cleveland Cavaliers    $4,320,360 ($6,948,764*)
20   2003/04  Cleveland Cavaliers    $4,018,920 ($6,675,060*)

Repetimos el proceso para Jordan

In [63]:
# prueba para uno
url_salarios_jordan = f'https://hoopshype.com/player/michael-jordan/salary/'
# Paso 2
response_j = requests.get(url_salarios_jordan)
# Paso 3
if str(response_j) == '<Response [200]>':
    print(response_j.status_code)
    # Paso 4
    sopa_jordan = (BeautifulSoup(response_j.content, 'html.parser'))
    time.sleep(random.uniform(1,3))
else: 
    print('Hay un error')

200

In [64]:
lista_jordan = sopa_jordan.findAll('div', {'class' : 'player-payroll'})
#aqui saco la sopa de datos con las dos tablas

In [65]:
# al tener dos tablas(una a futuro y otra del pasado, busco la del pasado)
for i in lista_jordan:
    if i.find('span').text == 'Past Salaries':
        tabla_salarios_pasado_jordan = i.find('table')

In [67]:
filas_jordan = tabla_salarios_pasado_jordan.find("tbody").findAll('tr') # me quedo con las filas de informacion

In [68]:
len(filas_jordan)

10

In [69]:
lista_vacia_jordan = []
for fila in filas_jordan:
    valores_j = fila.find_all('td')
    temporada_j = valores_j[0].text.strip()
    equipo_j = valores_j[1].text.strip()
    salario_j = valores_j[2].text.strip()

    diccionario_j = {'Temporada': temporada_j,
               'Equipo': equipo_j,
               'Salario': salario_j}
    lista_vacia_jordan.append(diccionario_j)

In [70]:
df_jordan = pd.DataFrame(lista_vacia_jordan)

In [72]:
df_jordan

  Temporada              Equipo                     Salario
0   2002/03  Washington Wizards    $1,030,000 ($1,746,871*)
1   2001/02  Washington Wizards    $1,000,000 ($1,714,095*)
2   1997/98       Chicago Bulls  $33,140,000 ($63,077,431*)
3   1996/97       Chicago Bulls  $30,140,000 ($58,685,292*)
4   1995/96       Chicago Bulls    $3,850,000 ($7,702,751*)
5   1994/95       Chicago Bulls    $3,850,000 ($7,936,957*)
6   1993/94       Chicago Bulls    $4,000,000 ($8,451,772*)
7   1992/93       Chicago Bulls    $4,000,000 ($8,704,964*)
8   1991/92       Chicago Bulls    $3,250,000 ($7,291,207*)
9   1990/91       Chicago Bulls    $2,500,000 ($5,871,997*)